import json

people = {
    "Власенко":   ["Ганна",    "Володимирівна", 2005],
    "Каштанова":   ["Христина",      "Едуардівна",   2006],
    "Вдовенко":  ["Яна",     "Валеріївна",    2006],
    "Валенштак": ["Марія",       "Сергіївна",    2006],
    "Бойко":    ["Ілля",     "Русланович",  2003],
    "Шевченко":  ["Тарас",       "Григорійович",    1814],
    "Козачук":   ["Назар",    "Степанович",  2002],
    "Романенко":    ["Роман",     "Романович",  2001],
    "Гуйда":   ["Анна",     "Вячеславівна",  2005],
    "Чернєв":   ["Володимир",     "Олексійович",  2012],
}   

with open("data.json", "w", encoding="utf-8") as f:
    json.dump(people, f, ensure_ascii=False, indent=4)

print(f"Словник записано у файл '{"data.json"}'")

with open("data.json", "r", encoding="utf-8") as f:
    loaded = json.load(f)

print(f"\nВміст файлу '{"data.json"}'\n")
print(f"{'Прізвище':<15} {'Ім\'я':<12} {'По батькові':<18} {'Рік народження'}")
print("-" * 60)
for surname, (name, patronymic, year) in loaded.items():
    print(f"{surname:<15} {name:<12} {patronymic:<18} {year}")